# GetLandingGeometries Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCLegacyStairOrRamp..::..GetLandingGeometries Method
IFCLegacyStairOrRamp Class See Also
---
Gets the geometries of landings.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<IList<GeometryObject>> GetLandingGeometries()
```

Visual Basic
---
```text
Public Function GetLandingGeometries As IList(Of IList(Of GeometryObject))
```

Visual C++
---
```text
public:
IList<IList<GeometryObject^>^>^ GetLandingGeometries()
```

# ### Return Value
The geometries of landings.
# See Also
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace